In this new section - Data selection, we will learn about advanced techniques of data selection with pandas, how to select a subset of data, how to select multiple rows and columns from a dataset, how to do sorting on a pandas DataFrame or a series, how to filter roles of a pandas DataFrame and also learn how to apply multiple filters to a pandas DataFrame. We will also loook at how to use the axis parameter in pandas and the uses of string methods in pandas. Finally we will learn how to change the datatype of a pandas series.

We will be suing a real dataset from zillow.com, an online real estate marketplace that releases house price datasets as part of their research effort.

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
%cd /content/drive/My Drive/Colab Notebooks

/content/drive/My Drive/Colab Notebooks

In [3]:
# We will import the pandas modules
import pandas as pd

We will then read in our dataset. Since it is a CSV file, we will be using a pandas'read_csv method for this. We will pass the file name with a comma as a separator to the read_csv method and we will create a DataFrame out of this data which we name data

In [4]:
data= pd.read_csv('data-zillow.csv', sep=',')
data.head()

         Date  RegionID    RegionName  ...        County SizeRank    Zhvi
0  2017-05-31      6181      New York  ...        Queens        0  672400
1  2017-05-31     12447   Los Angeles  ...   Los Angeles        1  629900
2  2017-05-31     17426       Chicago  ...          Cook        2  222700
3  2017-05-31     13271  Philadelphia  ...  Philadelphia        3  137300
4  2017-05-31     40326       Phoenix  ...      Maricopa        4  211300

[5 rows x 8 columns]

The DataFrame is created and we did read a few records from the dataset by performing the data.head() method on the DataFrame. This will give the output with columns, such as Date, and some location fields, such as RegionName, State, Metro and Country. The last column title Zhvi is a Zillow term and is the mean house price of that particular region.

**Sorting a pandas DataFrame**

In this video we will learn about the pandas sort_values method. We will also use various methods to sort a pandas DataFrame and learn how to sort a pandas series object.

Now let's start with the simple type of sorting. We will use pandas's sort_values method for this. For example, imagine that we want to sort the data by the Metro column. We need to pass Metro as a parameter to the sort_values emthod and call the method on the DataFrame.

In [5]:
data.sort_values('Metro')

             Date  RegionID    RegionName  ...        County SizeRank    Zhvi
9851   2017-05-31     48458      Westport  ...  Grays Harbor     9851  144600
4996   2017-05-31     36873          Elma  ...  Grays Harbor     4996  175200
5090   2017-05-31     35514       Hoquiam  ...  Grays Harbor     5090   95700
9401   2017-05-31     33215  Ocean Shores  ...  Grays Harbor     9401  152400
9149   2017-05-31     18370      Grayland  ...  Grays Harbor     9149  143900
...           ...       ...           ...  ...           ...      ...     ...
10764  2017-05-31     35349        Fraser  ...         Grand    10764  274500
10768  2017-05-31     17816       Dresser  ...          Polk    10768  189900
10774  2017-05-31     34232      Tamworth  ...       Carroll    10774  164100
10822  2017-05-31     18317     Goldsboro  ...      Caroline    10822  175700
10825  2017-05-31     26077       Nehalem  ...     Tillamook    10825  392200

[10830 rows x 8 columns]

If you notice , by default the Date column is sorted in ascending order. We can chnage the sorting order, giving the ascending parameter the value of False.

In [6]:
sorted = data.sort_values('Metro', ascending=False)

The ascending parameter is optional, and when not passed, it is set to True by default. Now we will look into how to sort data by more than 1 column. To do this we need to pass the list of columns, by which we want our data to be sorted, to the parameter column of the sort_values method.

In [9]:
sorted = data.sort_values(by=['Metro', 'County'])
sorted.head()

            Date  RegionID RegionName  ...        County SizeRank    Zhvi
2073  2017-05-31     30116   Aberdeen  ...  Grays Harbor     2073  127800
4568  2017-05-31     56078  Montesano  ...  Grays Harbor     4568  182000
4996  2017-05-31     36873       Elma  ...  Grays Harbor     4996  175200
5090  2017-05-31     35514    Hoquiam  ...  Grays Harbor     5090   95700
7108  2017-05-31      6275   Oakville  ...  Grays Harbor     7108  186900

[5 rows x 8 columns]

The data has now been sorted by Metro first and then County column, that is in the same order that we passed them into the sort_values method. We can take the multiple column sort further, and introduce a mixed ascending order. For example, we can sort by 3 columns: Metro, County and the Price column.

In [10]:
sorted = data.sort_values(by=['Metro', 'County', 'Zhvi'], ascending=[True, True, False])
sorted.head()

            Date  RegionID    RegionName  ...        County SizeRank    Zhvi
7108  2017-05-31      6275      Oakville  ...  Grays Harbor     7108  186900
4568  2017-05-31     56078     Montesano  ...  Grays Harbor     4568  182000
4996  2017-05-31     36873          Elma  ...  Grays Harbor     4996  175200
8420  2017-05-31     19269      McCleary  ...  Grays Harbor     8420  170700
9401  2017-05-31     33215  Ocean Shores  ...  Grays Harbor     9401  152400

[5 rows x 8 columns]

You must have noticed that we are passing a list of 3 Boolean values in ascending parameter. This sets the sort order to ascending for Metro, and County and descending fot the last column which is Zhvi.

Next we will see how to sort a series object. First, let's create a series. Let's select the RegionID column from our dataset and create a series.

In [11]:
regions= data.RegionID
type(regions)

pandas.core.series.Series

In [12]:
# Now let;s look that the original series by using regions.head()
regions.head()

0     6181
1    12447
2    17426
3    13271
4    40326
Name: RegionID, dtype: int64

Now let's sort it by calling the sort_values method on it. Since the dataset contains only 1 column, we do not need to pass any column name. Hence, the code to sort the data would be regions.sort_values().head().

In [13]:
regions.sort_values().head()

3043    3301
4159    3304
4986    3305
1762    3310
3116    3312
Name: RegionID, dtype: int64

**Filtering rows of a pandas DataFrame**

In this video, we will learn about methods for filtering rows and columns from a pandas DataFrame, we will introduce a couple of ways to accomplish this. We will also leran about pandas' filter method, and how to use it on our real dataset, as well as ways to protect data based on a Boolean series that we will create from our data. We will also learn how to pass the conditions directly to the DataFrame for filerting the data.


First we will explore the pandas'filter method for filtering data. We can filter columns using filter method. To do this we need to pass columns as a list to the filter method's items parameter.

In [14]:
filtered_data = data.filter(items=['State', 'Metro'])
filtered_data.head()

  State                           Metro
0    NY                        New York
1    CA  Los Angeles-Long Beach-Anaheim
2    IL                         Chicago
3    PA                    Philadelphia
4    AZ                         Phoenix

As you can see from the above result, we did filter columns by State and Metro and created a new DataFrame with the values from the filter columns. We then display the filter data using the head method. Next we will use the filter method to filter columns names using regular expressions. This is done by passing our regular expression to the regex parameter.

In [15]:
filtered_data = data.filter(regex='Region', axis=1)
filtered_data.head()

   RegionID    RegionName
0      6181      New York
1     12447   Los Angeles
2     17426       Chicago
3     13271  Philadelphia
4     40326       Phoenix

The filter method is not the only way to filter data. To filter rows, we can use some interesting techniques. First we will create a series of Boolean values. The Boolean value series is based on the price value column from our dataset. We are choosing to select rows that have lues of more than 500000

In [16]:
price_filter_series = data['Zhvi'] > 500000
price_filter_series.head()

0     True
1     True
2    False
3    False
4    False
Name: Zhvi, dtype: bool

The True values are those that match our condition, that is they stand for rows where the price is higher than 500000. Next we will use this Boolen series to filter the rows from our complete dataset, and get only those values that have a price higher than 500000. To do this we will pass the Boolena series to the dataset DataFrame in square brackets.

In [17]:
data[price_filter_series].head()

          Date  RegionID     RegionName  ...         County SizeRank     Zhvi
0   2017-05-31      6181       New York  ...         Queens        0   672400
1   2017-05-31     12447    Los Angeles  ...    Los Angeles        1   629900
6   2017-05-31     54296      San Diego  ...      San Diego        6   572100
8   2017-05-31     33839       San Jose  ...    Santa Clara        8   877400
10  2017-05-31     20330  San Francisco  ...  San Francisco       10  1194300

[5 rows x 8 columns]

The other way to filter a dataset without explicitly creating a Boolena series is by passing the condition for the values we want to the DataFrame directly. For example, imagine that we want to filter and select only rows where the house price is higher than or equal to 100000.

In [18]:
data[data.Zhvi >= 100000].head()

         Date  RegionID    RegionName  ...        County SizeRank    Zhvi
0  2017-05-31      6181      New York  ...        Queens        0  672400
1  2017-05-31     12447   Los Angeles  ...   Los Angeles        1  629900
2  2017-05-31     17426       Chicago  ...          Cook        2  222700
3  2017-05-31     13271  Philadelphia  ...  Philadelphia        3  137300
4  2017-05-31     40326       Phoenix  ...      Maricopa        4  211300

[5 rows x 8 columns]

**Applying multiple filter criteria to a pandas DataFrame**

In this video we will learn about methods for applying multiple filter criteria to a pandas DataFrame. We will use logical AND/OR conditional operators to select records from our real dataset. We will also see how to use the isin() method for filtering records. We will demonstrate the isin method on our real dataset for both single and multiple column filtering.

**Filtering based on multiple conditions- AND**

Now, let's look at some techniques to filter the data using multiple criteria or condition. First we will select those rows that have values for prices higher than 1000000 and for which the State parameter is New York (NY)

In [19]:
data= pd.read_csv('data-zillow.csv', sep=',')
data.head()

         Date  RegionID    RegionName  ...        County SizeRank    Zhvi
0  2017-05-31      6181      New York  ...        Queens        0  672400
1  2017-05-31     12447   Los Angeles  ...   Los Angeles        1  629900
2  2017-05-31     17426       Chicago  ...          Cook        2  222700
3  2017-05-31     13271  Philadelphia  ...  Philadelphia        3  137300
4  2017-05-31     40326       Phoenix  ...      Maricopa        4  211300

[5 rows x 8 columns]

In [20]:
data[(data['Zhvi'] >  1000000) & (data['State'] ==  'NY')].head()

            Date  RegionID  RegionName  ...       County SizeRank     Zhvi
1132  2017-05-31     18375  Great Neck  ...       Nassau     1132  1235800
2405  2017-05-31     54333   Scarsdale  ...  Westchester     2405  1468100
2619  2017-05-31     47495         Rye  ...  Westchester     2619  1736400
3032  2017-05-31     25725   Manhasset  ...       Nassau     3032  1483400
3064  2017-05-31     18955   Larchmont  ...  Westchester     3064  1052200

[5 rows x 8 columns]

Pass the above multi-condition to the database'DataFrame. In the above result, this technique has selected only those rows where the price value is higher than 1000000 and State is New York

**Filtering based on multiple conditions- OR**

We will use the same technique to filter data when we pass thses conditions with the logical operator - OR. Here, we select those records which are from either New York or California. To do this we join the conditions using the logical operator OR and pass this combined condition to the dataset.

In [21]:
data[((data['State'] ==  'CA') | (data['State'] ==  'NY'))].head()

          Date  RegionID     RegionName  ...         County SizeRank     Zhvi
0   2017-05-31      6181       New York  ...         Queens        0   672400
1   2017-05-31     12447    Los Angeles  ...    Los Angeles        1   629900
6   2017-05-31     54296      San Diego  ...      San Diego        6   572100
8   2017-05-31     33839       San Jose  ...    Santa Clara        8   877400
10  2017-05-31     20330  San Francisco  ...  San Francisco       10  1194300

[5 rows x 8 columns]

**Filtering using the isin method**

Another way to filter data is by using the isin method. We can use the isin method to filter our dataset by a list of values for a particular column or columns. We will select records from Metro column that have values of either New York ir San Francisco.


We will call the isin method on the Metro column and pass it a list containing the cities we want to select. This will create a Boolean series. We then pass the Boolean series to our dataset DataFrame to make the necessary filtering and selection.

In [22]:
filter = data['Metro'].isin(['New York', 'San Francisco'])
data[filter].head()

          Date  RegionID     RegionName  ...         County SizeRank     Zhvi
0   2017-05-31      6181       New York  ...         Queens        0   672400
10  2017-05-31     20330  San Francisco  ...  San Francisco       10  1194300
38  2017-05-31     13072        Oakland  ...        Alameda       38   680100
63  2017-05-31     12970         Newark  ...          Essex       63   232800
72  2017-05-31     25320    Jersey City  ...         Hudson       72   380000

[5 rows x 8 columns]

**Using the isin method with multiple conditions**

We can also use the isin method to filter rows based on values from multiple columns. In order to perfrom this, we pass a dictionary object where keys are column names and values are list of values for those columns from which we want to select records.

Taking an example, let's select values where the State parameter is California and the Metro parameter is San Francisco. We create a dictionary object with these 2 columns containing the values we want to select and then we pass this dictionary item to the isin method and call the isin method on the dataset. We then pass the filter to the DataFrame and select our recods.

In [23]:
filter = data.isin({'State': ['CA'], 'Metro':['San Francisco']})
data[filter].head()

  Date  RegionID RegionName State Metro County  SizeRank  Zhvi
0  NaN       NaN        NaN   NaN   NaN    NaN       NaN   NaN
1  NaN       NaN        NaN    CA   NaN    NaN       NaN   NaN
2  NaN       NaN        NaN   NaN   NaN    NaN       NaN   NaN
3  NaN       NaN        NaN   NaN   NaN    NaN       NaN   NaN
4  NaN       NaN        NaN   NaN   NaN    NaN       NaN   NaN

This will show NaN or not available for those records that do not fulfill multiple criteria that we specified earlier.

**Using the axis parameter in pandas**

In this video we will learn about when and where to use the axis paramter or keyword while doing data analysis in pandas. We will introduce the axis parameter and will walk through various values to which the axis keyword can be set to. We will demonstrate how setting axis to rows or columns changes a method's behavior.

**Usage of the axis parameter**

The axis parameter tells you a particular method along with which axis of the DataFrame the method should be executed.

The axis can be specified vertically or horizontally, or in other words, along rows or columns  use axis0 for rows and axis1 for columns.

In [24]:
data= pd.read_table('data-zillow.csv', sep=',')
data.head()

         Date  RegionID    RegionName  ...        County SizeRank    Zhvi
0  2017-05-31      6181      New York  ...        Queens        0  672400
1  2017-05-31     12447   Los Angeles  ...   Los Angeles        1  629900
2  2017-05-31     17426       Chicago  ...          Cook        2  222700
3  2017-05-31     13271  Philadelphia  ...  Philadelphia        3  137300
4  2017-05-31     40326       Phoenix  ...      Maricopa        4  211300

[5 rows x 8 columns]

In [25]:
data.axes

[RangeIndex(start=0, stop=10830, step=1),
 Index(['Date', 'RegionID', 'RegionName', 'State', 'Metro', 'County',
        'SizeRank', 'Zhvi'],
       dtype='object')]

**Axis usage examples**

In the axis usage examples we will calculate the mean for the values in the dataset. We have passed axis as 0. This means that the mean will be calculated along the row axis.

In [26]:
data.mean(axis=0)

RegionID     84344.818837
SizeRank      5414.500000
Zhvi        250307.590028
dtype: float64

Next we set axis to 1. We will use the exact method on the same dataset. However we will change axis from 0 to 1, the mean will be calculated along columns.

In [27]:
data.mean(axis=1).head()

0    226193.666667
1    214116.000000
2     80042.666667
3     50191.333333
4     83876.666667
dtype: float64

Sometimes, it is difficult to remember whether 0 or 1 is for rows or columns instead we can set axis to rows.

In [28]:
data.mean(axis='rows')

RegionID     84344.818837
SizeRank      5414.500000
Zhvi        250307.590028
dtype: float64

In [29]:
data.mean(axis='columns')

0        226193.666667
1        214116.000000
2         80042.666667
3         50191.333333
4         83876.666667
             ...
10825    143034.000000
10826     75610.333333
10827    326571.666667
10828    141217.000000
10829    119674.000000
Length: 10830, dtype: float64

**More exaples of the axis keyword**

Here we will use the drop method to drop a row or record. We will tell the drop method to drop the record at the index of 0 by passing the keyword axis as 0.

In [30]:
data.drop(0, axis=0).head()

         Date  RegionID    RegionName  ...        County SizeRank    Zhvi
1  2017-05-31     12447   Los Angeles  ...   Los Angeles        1  629900
2  2017-05-31     17426       Chicago  ...          Cook        2  222700
3  2017-05-31     13271  Philadelphia  ...  Philadelphia        3  137300
4  2017-05-31     40326       Phoenix  ...      Maricopa        4  211300
5  2017-05-31     18959     Las Vegas  ...         Clark        5  216500

[5 rows x 8 columns]

We will set axis to 1 which tells the drop method to drop the column with the Date label.

In [31]:
data.drop('Date', axis=1).head()

   RegionID    RegionName State  ...        County SizeRank    Zhvi
0      6181      New York    NY  ...        Queens        0  672400
1     12447   Los Angeles    CA  ...   Los Angeles        1  629900
2     17426       Chicago    IL  ...          Cook        2  222700
3     13271  Philadelphia    PA  ...  Philadelphia        3  137300
4     40326       Phoenix    AZ  ...      Maricopa        4  211300

[5 rows x 7 columns]

We can also use the axis keyword in filtering method. Here we will filter by regex Region with axis set to column

In [32]:
data.filter(regex='Region', axis=1).head()

   RegionID    RegionName
0      6181      New York
1     12447   Los Angeles
2     17426       Chicago
3     13271  Philadelphia
4     40326       Phoenix

**Using string methods in pandas**

In this video, we will learn about using various string methods on a pandas series. We will explore some of string methods and we will use these string methods to select and change values from our dataset.

In [33]:
data= pd.read_table('data-zillow.csv', sep=',')
data.head()

         Date  RegionID    RegionName  ...        County SizeRank    Zhvi
0  2017-05-31      6181      New York  ...        Queens        0  672400
1  2017-05-31     12447   Los Angeles  ...   Los Angeles        1  629900
2  2017-05-31     17426       Chicago  ...          Cook        2  222700
3  2017-05-31     13271  Philadelphia  ...  Philadelphia        3  137300
4  2017-05-31     40326       Phoenix  ...      Maricopa        4  211300

[5 rows x 8 columns]

**Checking for a substring**

In order to lean how to use string method to check for a substring from pandas series. We use the contains method from the str package.


Here we call the str.contains method on the RegionNmae series from our dataset. We are looking for records that have the New subtrstring in them. It will print out a Boolean series, print True when substring is found and False when substring is not found.

In [34]:
data.RegionName.str.contains('New').head()

0     True
1    False
2    False
3    False
4    False
Name: RegionName, dtype: bool

**Changing the values of a series or column into uppercase**


There is a very common string method for converting Python strings to uppercase. We can use it to convert all the values from a column into uppercase. We do this by calling str.upper on the series. Here, we call it on the RegionName column.

In [35]:
data.RegionName.str.upper().head()

0        NEW YORK
1     LOS ANGELES
2         CHICAGO
3    PHILADELPHIA
4         PHOENIX
Name: RegionName, dtype: object

In [36]:
data.RegionName.str.lower().head()

0        new york
1     los angeles
2         chicago
3    philadelphia
4         phoenix
Name: RegionName, dtype: object

In [37]:
# Find the length of every value of a column
data.County.str.len().head()

0     6
1    11
2     4
3    12
4     8
Name: County, dtype: int64

In [38]:
# Remove white space using the lstrip() method

data.RegionName.str.lstrip().head()

0        New York
1     Los Angeles
2         Chicago
3    Philadelphia
4         Phoenix
Name: RegionName, dtype: object

In [39]:
# Replacing parts of a column's values by using replace
data.RegionName.str.replace(' ', '').head() # It will replace the spaces in the RegionName column from our dataset with no space

0         NewYork
1      LosAngeles
2         Chicago
3    Philadelphia
4         Phoenix
Name: RegionName, dtype: object

**Changing the datatype of a pandas series**

In this video we will learn about changing the datatype of a pandas series. We will see how to change datatypes after reading the data within. We will also learn how to change datatypes while reading data in pandas. We will walk through an example of chaning an int column to float. We will see how to convert a string values column to the datatime datatype.

In [40]:
data= pd.read_table('data-zillow.csv', sep=',')
data.head()

         Date  RegionID    RegionName  ...        County SizeRank    Zhvi
0  2017-05-31      6181      New York  ...        Queens        0  672400
1  2017-05-31     12447   Los Angeles  ...   Los Angeles        1  629900
2  2017-05-31     17426       Chicago  ...          Cook        2  222700
3  2017-05-31     13271  Philadelphia  ...  Philadelphia        3  137300
4  2017-05-31     40326       Phoenix  ...      Maricopa        4  211300

[5 rows x 8 columns]

**Changing an int datatype column to a float.**

In [41]:
# Checking the datatypes of columns from our real dataset.
data.dtypes

Date          object
RegionID       int64
RegionName    object
State         object
Metro         object
County        object
SizeRank       int64
Zhvi           int64
dtype: object

We then use astype method to change the datatype.  We will pass float to the astype method and call this method ont eh column , the datatype of which we want to change.

In [42]:
data['Zhvi'] = data.Zhvi.astype(float)
data.dtypes

Date           object
RegionID        int64
RegionName     object
State          object
Metro          object
County         object
SizeRank        int64
Zhvi          float64
dtype: object

**Chaging the datatype while reading data**


We just changed the datatype of the column after the data has been read into pandas. Alternatively, we cna change the datatype while reading in the data. For this we will pass the column name and the datatype into the column we want to chage to read data method. The column we wanted in float has been imprted as float64.

In [44]:
data2= pd.read_csv('data-zillow.csv', sep=',', dtype={'Zhvi':float})
data2.dtypes

Date           object
RegionID        int64
RegionName     object
State          object
Metro          object
County         object
SizeRank        int64
Zhvi          float64
dtype: object

**Converting string to datetime**


The main thing here is that our dataset has a date column but it shows up as an object or a string datatype. We will convert this into a proper datatime column.

We will use pandas'to_datetime method for this, which can parse a few different datetime formats.

In [45]:
pd.to_datetime(data2.Date, infer_datetime_format=True).head()

0   2017-05-31
1   2017-05-31
2   2017-05-31
3   2017-05-31
4   2017-05-31
Name: Date, dtype: datetime64[ns]

As we can see that our Date field has been changed from an object to datetime64.